[
    {
        "title": "Zucchini Slice",
        "servings": 15,
        "totalTime": 45,
        "ingredients": [
            "5 egggs",
            "1 cup self-raising flour",
            "375g zucchini, grated",
            "1 large Onion, finely chopped",
            "200g rindless bacon, chopped",
            "1 cup grated cheddar cheese",
            "1/4 cup vegetable oil"
        ],
        "directions": [
            "Step 1: Preheat oven to 170C.",
            "Step 2: Beat the eggs in a large bowl until combined. Add the flour and beat until smooth.",
            "Step 3: Add the zucchini, onion, bacon, cheese and oil and stir to combine.",
            "Step 4: Grease your cooking pan and pour the mixture into the pan and bake for 30 mins."
        ],
        "postAuthor": "Alan Kay"
    },
    {
        "title": "Easy Fried Rice",
        "servings": 2,
        "totalTime": 45,
        "ingredients": [
            "1 cup white long-grain rice",
            "2 tsp vegetable oil",
            "2 eggs, lightly whisked",
            "2 bacon rashers, chopped",
            "1 carrot, peeled and grated",            
            "2 shallots, trimmed, finely sliced",            
            "1/2 cup frozen peas, thawed",         
            "1 tbsp soy sauce",         
            "Sesame seeds, to serve",
            "Shallots, sliced, extra, to serve"
        ],
        "directions": [
            "Step 1: Cook the ricein a large saucepan of boiling water for 12 minutes or until tender. Drain and leave to cool.",
            "Step 2: Heat oil in non-stick wok or large frying pan over medium heat. Add eggs and swirl over base to form an omelette. Cook for 2 minutes or until set.",
            "Step 3: Transfer to a chopping board. Set aside to cool slightly.",
            "Step 4: Add bacon to wok. Cook 4 minutes until light golden.",
            "Step 5: Add carrot, shallots, peas and cooked rice and cook 3-4 minutes while stirring.",
            "Step 6: Add egg and soy sauce and stir until heated through. Sprinkle with sesame seeds and extra shallots and serve immediately."
        ],
        "postAuthor": "Amiko"
    },
    {
        "title": "Impossible Quiche",
        "servings": 1,
        "totalTime": 50,
        "ingredients": [
            "125g ham, chopped",
            "1 small onion, finely chopped",   
            "1 1/2 cups (180g) grated Devondale Tasty Cheese Block (500g)",           
            "1/3 cup (50g) self-raising flour",          
            "Salt & freshly ground pepper, to season",         
            "4 eggs",    
            "1 1/2 cups (375ml) milk"
        ],
        "directions": [
            "Step 1: Preheat oven to 200°C. Grease a 5 cup capacity pie dish.",
            "Step 2: Combine ham, onion, cheese, flour, salt and pepper in a medium bowl. Scatter over base of dish.",
            "Step 3: Whisk eggs and milk together in a large jug and pour over ham mixture.",
            "Step 4: Cook for about 40 minutes or until puffed and golden.",
            "Step 5: Cool slightly. Serve warm or cold."
        ],
        "postAuthor": "Amiko"
    },
    {
        "title": "Thai Beef Salad",
        "servings": 4,
        "totalTime": 30,
        "ingredients": [
            "1 1/2 tbsp fresh lime juice",
            "1 garlic clove, crushed",        
            "1 tbsp finely chopped palm sugar",
            "1 tbsp fish sauce",
            "2 tsp sesame oil",
            "1 tsp soy sauce", 
            "2 tsp finely grated fresh ginger", 
            "1 (about 680g) beef rump steak",
            "1 x 200g grape tomatoes, quartered",
            "1 cucumber, halved lengthways, thinly sliced diagonally",
            "1 red onion, halved, cut into thin wedges",
            "2 long fresh red chillies, halved, deseeded, thinly sliced lengthways",
            "1 bunch fresh mint, leaves picked, large leaves torn", 
            "1 bunch fresh coriander, leaves picked",            
            "1 bunch fresh Thai basil, leaves picked, large leaves torn",            
            "1/3 cup toasted peanuts, coarsely chopped",
            "4 kaffir lime leaves, centre veins removed, finely shredded"
        ],
        "directions": [
            "Step 1: Whisk together lime juice, garlic, fish sauce, sesame oil, soy sauce, ginger and palm sugar in a jug.",
            "Step 2: Place the steak in a glass or ceramic dish. Drizzle with half the dressing. Cover with plastic wrap and place in the fridge, turning occasionally, for 2 hours to develop the flavours.",
            "Step 3: Transfer to a plate. Cover with foil and set aside for 10 minutes to rest.",
            "Step 4: Place the tomato, cucumber, onion, chilli, mint, coriander, basil, peanuts and lime leaves in a large bowl.",
            "Step 5: Thinly slice steak across the grain and add to the salad.",
            "Step 6: Drizzle with remaining dressing and gently toss to combine. Divide salad among bowls and serve immediately."
        ],
        "postAuthor": "Brian Kernighan"
    },
    {
        "title": "Baked ricotta cake",
        "servings": 12,
        "totalTime": 45,
        "ingredients": [
            "200g unsalted butter, chilled, chopped",
            "1 3/4 cup (385g) caster sugar",
            "5 eggs",
            "3 cups (450g) plain flour",
            "1 tsp baking powder",
            "700g fresh ricotta",
            "500g cream cheese, at room temperature",
            "2 tsp vanilla extract",
            "Pure icing sugar, to dust"
        ],
        "directions": [
            "To make the pastry, place butter and 3/4 cup (165g) sugar in a stand mixer with the paddle attachment and beat until smooth.", 
            "Beat in 1 egg until well combined. Fold in flour, baking powder and a pinch of salt.",
            "Cut one-third of the dough, flatten into a rectangle and enclose in plastic wrap. Shape the larger piece into a rectangle and enclose in plastic wrap. Chill both blocks of pastry for 2 hours.",
            "Preheat oven to 200°C. Grease a 20cm x 30cm x 5cm rectangular lamington pan and line with baking paper, leaving a 3cm overhang.", 
            "Roll larger piece of pastry out between 2 sheets of lightly floured baking paper to 5mm thick. Use pastry to line the base of prepared pan, trimming the edges to fit snugly, then prick all over with a fork.", 
            "Place pan on a baking tray and bake for 20-25 minutes until base is golden. Remove from oven and cool completely.",
            "Roll small pastry rectangle out between 2 sheets of floured baking paper into a 3mm-thick rectangle. Cut into long 6cm- wide strips to line the sides of the pan. Refrigerate while you make the filling. Reduce oven to 160°C.", 
            "To make filling, lightly beat remaining 4 eggs. Place ricotta and cream cheese in a stand mixer with the paddle attachment and beat until smooth. Beat in vanilla, remaining 1 cup (220g) sugar and eggs to combine.",
            "Line sides of the pan with 6cm strips of pastry, gently pressing them onto top of cooked base to create a join (the pastry is soft, but will come together when cooked).",
            "Use a small sharp knife to trim the pastry so it’s flush with the top of the pan. Spoon filling into the pastry shell.", 
            "Place pan on a baking tray and bake for 1 hour 20 minutes or until edges are set with a very slight wobble in the centre (it may crack a little, but will settle when it cools).",
            "Turn off the oven and set the door ajar with a wooden spoon. Leave the cake to cool completely in the oven, then chill for 6 hours to set. Use the baking paper overhang to carefully lift cake out of the pan. Dust cake with icing sugar to serve."
        ],
        "postAuthor": "Amiko"
    },
    {
        "title": "Fried Ice Cream",
        "servings": 4,
        "totalTime": 45,
        "ingredients": [
            "1 pint ice cream (such as Breyers Delights Vanilla Cupcake Ice Cream)",
            "1 1/2 tbsp. butter",
            "1 1/4 c. corn cereal, crushed",
            "1/2 tsp. ground cinnamon",
            "2 tsp. granulated sugar",
            "Whipped cream, for garnish",
            "Sprinkles, for garnish",
            "4 maraschino cherries, for garnish"
        ],
        "directions": [
            "Line a small sheet tray with parchment paper and place in freezer. Scoop ice cream into 4 balls and place on prepared sheet tray.", 
            "Keep in freezer while making cereal mixture, at least 30 minutes.",
            "In a medium skillet over medium heat, melt butter. Add corn cereal and cinnamon and cook, stirring occasionally, until the cereal turns golden, 5 to 7 minutes.", 
            "Remove from heat and stir in sugar. Place on a shallow bowl and let cool.",
            "Remove ice cream balls from freezer and roll in cereal mixture. Top with whipped cream, sprinkles, and a cherry, and serve immediately."
        ],
        "postAuthor": "Kent Beck"
    },
    {
        "title": "No-Bake Jalapeno Popper Cheese Balls with Bacon & Chives",
        "servings": 4,
        "totalTime": 50,
        "ingredients": [
            "1-pound bacon",
            "10-ounces plain cream cheese, softened",
            "1 tablespoon sour cream",
            "2 tablespoons minced fresh chives",
            "¼ cup minced jalapeño, seeded",
            "½ cup sharp white cheddar, shredded",
            "2 small shallots, minced",
            "¼ teaspoon coarse salt",
            "¼ teaspoon garlic powder",
            "¼ teaspoon onion powder"
        ],
        "directions": [
            "In a large skillet over medium-low heat, cook the bacon until crispy, about 8-10 minutes, and then set aside on a paper towel-lined plate to soak up any excess oil.", 
            "Once cooled, finely chop the bacon and place it in a wide shallow bowl.",
            "In a large bowl, mix together the cream cheese, sour cream, chives, jalapenos, cheddar, shallots, salt, garlic powder, and onion powder until thoroughly combined.", 
            "Season to taste with salt and then refrigerate for at least 20 minutes.",
            "Using a tablespoon or small cookie scoop as your guide, portion out a small amount of the filling and form it into a ball. Roll the cheese ball through the bacon and repeat until all of the mixture is gone.",
            "Refrigerate until you’re ready to serve."
        ],
        "postAuthor": "Amiko"
    },
    {
        "title": "Greek Spinach and Cheese Parcels (Spanakopita)",
        "servings": 5,
        "totalTime": 35,
        "ingredients": [
            "300 grams spinach",
            "½ small onion - finely chopped",
            "1 clove garlic - finely chopped",
            "100 grams feta cheese",
            "6 - 8 filo pastry sheets (depending on size)",
            "3 tablespoons olive oil + for brushing on top before baking",
            "1 teaspoon cumin",
            "Salt to taste"
        ],
        "directions": [
            "Preheat the oven 200ºC.",
            "Shredded spinach and chop the onion. Chop the garlic clove as well and set aside.",
            "In a pan, on medium heat, heat the oil and saute the onion and garlic till they turn slightly golden-brown (about one minute).",
            "Add in the spinach and cumin into the pan. Cook till the water from the spinach evaporates. Keep stirring the spinach so it doesn't burn. This should roughly take about 7 - 8 minutes.",
            "Once done, remove from heat and let it cool.",
            "Add the feta cheese to this spinach mixture and mix thoroughly.",
            "Cut long strips of the filo pastry - about 2 inches wide. Brush one pastry sheet with olive oil and place another sheet on top of it. The oil will make them stick together.",
            "Place about 1 ½ tablespoons of the spinach-feta mixture on one end of the sheet and keep folding it into triangles till the end. Seal the end with olive oil.",
            "Repeat steps 7 and 8 till all the mixture is used.",
            "Lightly oil a baking tray. Brush olive oil on to each Spanakopita parcel and place on the tray.",
            "Bake for about 10 minutes - or until they turn golden brown.",
            "Serve with Tzatziki sauce."
        ],
        "postAuthor": "Edward V. Berard"
    },
    {
        "title": "Sex in the Driveway",
        "servings": 1,
        "totalTime": 3,
        "ingredients": [
            "1 ounce peach schnapps",
            "1 ounce blue curacao",
            "2 ounces vodka (or white rum)",
            "Sprite"
        ],
        "directions": [
            "Put crushed ice in a highball glass.",
            "Pour in the ingredients, in order, ending by topping it off with Sprite.",
            "Stir and serve with a straw.",
            "Garnish with a lemon wheel."
        ],
        "postAuthor": "Edward V. Berard"
    },
    {
        "title": "Easy Apple Cider",
        "servings": 8,
        "totalTime": 65,
        "ingredients": [
            "1 (64 fluid ounce) bottle apple cider",
            "3 cinnamon sticks",
            "1 teaspoon whole allspice",
            "1 teaspoon whole cloves",
            "⅓ cup brown sugar"
        ],
        "directions": [
            "In a slow cooker, combine apple cider and cinnamon sticks.", 
            "Wrap allspice and cloves in a small piece of cheesecloth, and add to pot.", 
            "Stir in brown sugar. Bring to a boil over high heat. Reduce heat, and keep warm."
        ],
        "postAuthor": "Brian Kernighan"
    }
]